---
kind: type
id: T:Autodesk.Revit.DB.CurtainCell
source: html/97401874-6fa9-eac0-6190-24687861168c.htm
---
# Autodesk.Revit.DB.CurtainCell

Represents a CurtainCell within Autodesk Revit.

## Syntax (C#)
```csharp
public class CurtainCell : APIObject
```